configuration/src/Catalogs/ДействияПриСменеСтатуса/ДействияПриСменеСтатуса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияПриСменеСтатуса</name>
  <comment>Используется для описания действий, которые будут использоваться при смене статуса</comment>
  <predefined>
    <items>
      <name>ДобавлениеВОчередьТестирования</name>
      <description>Добавление в очередь тестирования</description>
    </items>
    <items>
      <name>ОставитьТекущегоИсполнителя</name>
      <description>Оставить текущего исполнителя</description>
    </items>
    <items>
      <name>СменаИсполнителяНаАвтораЗадачи</name>
      <description>Смена исполнителя на автора задачи</description>
    </items>
    <items>
      <name>СменаИсполнителяНаЗаказчика</name>
      <description>Смена исполнителя на заказчика</description>
    </items>
    <items>
      <name>СменаИсполнителяНаНезаполненноеЗначение</name>
      <description>Смена исполнителя на незаполненное значение</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПоследнегоРазработчика</name>
      <description>Смена исполнителя на последнего разработчика</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПоследнегоРевьюера</name>
      <description>Смена исполнителя на последнего ревьюера</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПоследнегоТестировщика</name>
      <description>Смена исполнителя на последнего тестировщика</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПредыдущегоИсполнителя</name>
      <description>Смена исполнителя на предыдущего исполнителя</description>
    </items>
    <items>
      <name>УдалениеИзОчередиТестирования</name>
      <description>Удаление из очереди тестирования</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидДействия</name>
    <comment>Вид действия</comment>
    <type>
      <types>EnumRef.ВидыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратноеДействие</name>
    <type>
      <types>CatalogRef.ДействияПриСменеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипОбъекта</name>
    <comment>Тип объекта, к которому относится данное действие</comment>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыОбъектов</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>CatalogRef.ТипыОбъектовВладельцев</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/ВидыДействий/ВидыДействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействий</name>
  <comment>Используется для определения типа действия</comment>
  <enumValues>
    <name>СменаИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВОчередь</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/ДействияПриСменеСтатуса/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.ДействияПриСменеСтатуса.ПроверитьПредопределенныеЭлементы";
	  
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействияПриСменеСтатуса.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДействияПриСменеСтатуса КАК ДействияПриСменеСтатуса
	|ГДЕ
	|	ДействияПриСменеСтатуса.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДействиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НоваяСтрока = ДействиеОбъект.ТипыОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_Задача;
		
		Если Выборка.Ссылка = Справочники.ДействияПриСменеСтатуса.ДобавлениеВОчередьТестирования Тогда
			ДействиеОбъект.ВидДействия = Перечисления.ВидыДействий.ДобавлениеВОчередь;
			ДействиеОбъект.ОбратноеДействие = Справочники.ДействияПриСменеСтатуса.УдалениеИзОчередиТестирования;
			
		ИначеЕсли Выборка.Ссылка = Справочники.ДействияПриСменеСтатуса.УдалениеИзОчередиТестирования Тогда
			ДействиеОбъект.ВидДействия = Перечисления.ВидыДействий.ДобавлениеВОчередь;
			ДействиеОбъект.Служебный = Истина;
			
		Иначе
			ДействиеОбъект.ВидДействия = Перечисления.ВидыДействий.СменаИсполнителя;			
		КонецЕсли;
		
		ДействиеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
